#include "headers.h"

// 112 Êëèïàëêî Ìèõàèë Ìèõàéëîâè÷

int index_sort(double number[], int k, int ind[])           // ñîðòèðîâêà îáìåíàìè, íà âõîä ìàññèâ ÷èñåë, êðàòíîñòü äëèíû ìàññèâà k, ìàññèâ èíäåêñîâ
{
    int tmp;                                                // âðåìåííàÿ ïåðåìåííàÿ äëÿ èíäåêñîâ

    for(int i = 0; i < k*N; ++i)                            // öèêë ïîèñêà ìèíèìóìà ÷èñëà ïî èíäåêñó èç âñåõ ÷èñåë ìàññèâà
    {
        for (int j = i; j < k*N; ++j)                       // öèêë ñäâèãà èíäåêñà ìèíèìóìà âëåâî, j = êðàéíèé ëåâûé ýëåìåíò
        {
            double min = number[ind[i]];                    // êàæäûé ðàç îáúÿâëÿåì íîâûé ìèíèìóì - ýòîò ìèíèìóì ðàâåí êðàéíåìó ëåâîìó ÷èñëó
            if (number[ind[j]] <= min)                      // èùåì ìèíèìóì ñ ïîìîùüþ ñðàâíåíèé
            {
                tmp = ind[i];                               // ñîõðàíÿåì çíà÷åíèå èíäåêñà êðàéíåãî ýëåìåíòà
                ind[i] = ind[j];                            // êëàäåì â ind[i] çíà÷åíèå ind[j]
                ind[j] = tmp;                               // êëàäåì â ind[j] çíà÷åíèå tmp
            }
        }
    }

    return 1;                                               // âîçâðàùàåì òîëüêî ìàññèâ èíäåêñîâ, îñòàëüíûå ïàðàìåòðû îñòàíóòñÿ íåòðîíóòûìè
}


